/* ------------------------------------------------------------------------- */
/* rnLine_Trace.h															 */
/* ETロボコン開発															 */
/* rnLine_Trace.cppのヘッダーファイルです。									 */
/* 																			 */
/* ------------------------------------------------------------------------- */
/* 番号		更新履歴							日付		氏名			 */
/* ------------------------------------------------------------------------- */
/* 000000	新規作成							2018/07/02	甲田  啓朗		 */
/* 000001	コメント追加						2018/07/12	甲田  啓朗		 */
/* 000002	変数の追加							2018/07/20	甲田  啓朗		 */
/* ------------------------------------------------------------------------- */


//#ifndef EV3_APP_LINETRACER_H_
//#define EV3_APP_LINETRACER_H_

/* ------------------------------------------------------------------------- */
/* include ファイル															 */
/* ------------------------------------------------------------------------- */
#include <stdio.h>

/* ------------------------------------------------------------------------- */
/* 定数宣言																	 */
/* ------------------------------------------------------------------------- */
const SINT rnInverted_Control::ZERO = 0;		/* 0						 */
const SINT rnInverted_Control::LOW = 30;		/* 低速						 */
const SINT rnInverted_Control::NORMAL = 50;		/* 通常						 */
const SINT rnInverted_Control::HIGH = 70;		/* 高速						 */

/* ------------------------------------------------------------------------- */
/* Class																	 */
/* ------------------------------------------------------------------------- */
class rnLine_Trace {
public:

	rnLine_Trace();										/* コンストラクタ	 */
    ~rnLine_Trace();									/* デストラクタ		 */

	SINT LineTracing();									/* ライントレース	 */

private:

	SINT i_color;				/* しきい値セットメソッドからの戻り値格納用	 */
	SINT i_direction;			/* ColorDirectionメソッドからの戻り値格納用	 */
	SINT i_initialized;	/* 倒立走行に必要なものをリセットするか決める変数	 */

	SINT ColorDirection(SINT i_color);/* ラインの色から走行体の向きを決める	 */
};

//#endif  // EV3_APP_LINETRACER_H_

/* ------------------------------------------------------------------------- */
/* 				Copyright HAL College of Technology & Design				 */
/* ------------------------------------------------------------------------- */

