#ifndef BLUETOOTH
#define BLUETOOTH
/*	-----------------------------------------------------------------------	 */
/*	frBluetooth.h															 */
/*	Bluetooth接続のクラス													 */
/*	EV３とPC（Tera Term）の通信												 */
/*	-----------------------------------------------------------------------	 */
/*	番号	更新履歴									日付		氏名	 */
/*	-----------------------------------------------------------------------	 */
/*	000000	新規作成									2018/06/29	小西 巧  */
/*	000001	シングルトンのみ対応						2018/07/01	小西 巧	 */
/*	-----------------------------------------------------------------------	 */

/*	-----------------------------------------------------------------------	 */
/*	includeファイル															 */
/*	-----------------------------------------------------------------------	 */
//using namespace ev3api;
#include "ev3api.h"
#include "common.h"

/*	-----------------------------------------------------------------------	 */
/*	クラス定義																 */
/*	-----------------------------------------------------------------------	 */
class frBluetooth {
public:											/*	パブリック-------------	 */
	
	void Send(SCHR);							/*	EV3からPC送信			 */
	SCHR  Reception(void);						/*	PCからEV3受信			 */
	void Cutting(void);							/*	Bluetooth切断			 */
	
	static frBluetooth& GetInstance(void);		/*	クラス生成用			 */
	
 
private:										/*	プライベート-----------	 */
	frBluetooth();								/*	コンストラクタ			 */
	~frBluetooth();								/*	デストラクタ			 */
	
	/*	シングルトン作成用-------------------------------------------------	 */
	frBluetooth(const frBluetooth &x){ };
	frBluetooth&operator=(const frBluetooth&){return *this;};
	
	FILE *bt;									/*	Bluetooth接続ファイル	 */

};
/*	-----------------------------------------------------------------------	 */
/*				Copyright HAL College of Technology & Design				 */
/*	-----------------------------------------------------------------------	 */
#endif