/*	-----------------------------------------------------------------------	 */
/*	frBluetooth.cpp															 */
/*	frBluetooth.hの処理内容													 */
/*	EV３とPC（Tera Term）の通信												 */
/*	-----------------------------------------------------------------------	 */
/*	番号	更新履歴									日付		氏名	 */
/*	-----------------------------------------------------------------------	 */
/*	000000	新規作成									2018/06/29	小西 巧  */
/*	000001	シングルトンのみ対応						2018/07/01	小西 巧	 */
/*	-----------------------------------------------------------------------	 */

/*	-----------------------------------------------------------------------	 */
/*	includeファイル															 */
/*	-----------------------------------------------------------------------	 */
#include "frBluetooth.h"

/* ------------------------------------------------------------------------- */
/* ■■■ public ■■■														 */
/* ------------------------------------------------------------------------- */
/* ------------------------------------------------------------------------- */
/* 関数名	:frBluetooth::GetInstance										 */
/* 機能名	: Bluetooth通信：クラス生成										 */
/* 機能概要	:クラスの実態を返す												 */
/* 引数		:void			:なし											 */
/* 戻り値	:frBluetooth	:obj			:クラスの実態					 */
/* 作成日	: 2018/07/01	小西 巧			新規作成						 */
/* ------------------------------------------------------------------------- */
frBluetooth& frBluetooth::GetInstance(void)
{
	static frBluetooth obj;
	return obj;
}
/* ------------------------------------------------------------------------- */
/* 関数名	:frBluetooth::Send												 */
/* 機能名	:Bluetooth通信：送信											 */
/* 機能概要	:EV3から文字を1文字デバイスに送信								 */
/* 引数		: char			: string		:送信文字（１文字）				 */
/* 戻り値	: void			: なし											 */
/* 作成日	: 2018/07/01	小西 巧			新規作成						 */
/* ------------------------------------------------------------------------- */
void frBluetooth::Send(SCHR  string)
{
	fprintf(bt, &string);
}

/* ------------------------------------------------------------------------- */
/* 関数名	:frBluetooth::Reception											 */
/* 機能名	: Bluetooth通信：受信											 */
/* 機能概要	:デバイスから文字を1文字受信									 */
/* 引数		:void			:なし											 */
/* 戻り値	:char			:string			:受信文字(1文字)				 */
/* 作成日	: 2018/07/01	小西 巧			新規作成						 */
/* ------------------------------------------------------------------------- */
SCHR  frBluetooth::Reception(void)
{
	SCHR string = fgetc(bt);
	return string;
}

/* ------------------------------------------------------------------------- */
/* 関数名	:frBluetooth::Cutting											 */
/* 機能名	: Bluetooth通信：切断											 */
/* 機能概要	:デバイスとEV3の接続を切る										 */
/* 引数		:void			:なし											 */
/* 戻り値	:void			:なし											 */
/* 作成日	: 2018/07/01	小西 巧			新規作成						 */
/* ------------------------------------------------------------------------- */
void frBluetooth::Cutting(void)
{
		if( bt!=NULL ){
			fclose(bt);
			bt=NULL;
		}
}

/* ------------------------------------------------------------------------- */
/* ■■■ private ■■■													 */
/* ------------------------------------------------------------------------- */

/* ------------------------------------------------------------------------- */
/* 関数名	:frBluetooth::frBluetooth										 */
/* 機能名	: Bluetooth通信：コンストラクタ									 */
/* 機能概要	:初回インスタンス生成時にコール									 */
/* 引数		:void			:なし											 */
/* 戻り値	:void			:なし											 */
/* 作成日	: 2018/07/01	小西 巧			新規作成						 */
/* ------------------------------------------------------------------------- */
frBluetooth::frBluetooth()
{	
	/*	Buetooth接続-------------------------------------------------------	 */
	bt = ev3_serial_open_file(EV3_SERIAL_BT);
	assert(bt != NULL);
}

/* ------------------------------------------------------------------------- */
/* 関数名	:frBluetooth::~frBluetooth										 */
/* 機能名	: Bluetooth通信：デストラクタ									 */
/* 機能概要	:staticクラスのため、コールされない								 */
/* 引数		:void			:なし											 */
/* 戻り値	:void			:なし											 */
/* 作成日	: 2018/07/01	小西 巧			新規作成						 */
/* ------------------------------------------------------------------------- */
frBluetooth::~frBluetooth()
{

}

/*	-----------------------------------------------------------------------	 */
/*				Copyright HAL College of Technology & Design				 */
/*	-----------------------------------------------------------------------	 */
