#ifndef __MOTOR__
#define __MOTOR__
/*	-----------------------------------------------------------------------	 */
/*	dgStatic_Color_Get.h												   	 */
/*	カラーセンサー情報取得													 */
/*	-----------------------------------------------------------------------	 */
/*	番号	更新履歴								日付		氏名		 */
/*	-----------------------------------------------------------------------	 */
/*	000000	新規作成								2018/05/15	髙岡 諒太	 */
/*	-----------------------------------------------------------------------	 */
/*	-----------------------------------------------------------------------	 */
/*	include	ファイル														 */
/*	-----------------------------------------------------------------------	 */
#include "..\common\common.h"								/* typedef宣言等			 */
#include "ev3api.h"								/* ev3apiライブラリー		 */
/* クラス宣言--------------------------------------------------------------- */
class dgMotor_Get{

public:
	/* publicメソッド */
	static dgMotor_Get& GetInstance(void);		/* 実体作成メソッド			 */
	SINT MotorGet();							/* 色情報引き渡しメソッド	 */
	void MotorUpdate(void);						/* 角位置更新メソッド		 */
private:
	/* privateメソッド------------------------------------------------------ */
	dgMotor_Get();								/* コンストラクタ			 */
	~dgMotor_Get();								/* デストラクタ				 */
	/* シングルトンに必要な奴 */
	dgMotor_Get(const dgMotor_Get &x) { };
	dgMotor_Get&operator=(const dgMotor_Get &) { return *this; };


	/* private変数---------------------------------------------------------- */
	uint8_t i_motor_info;							/* 取得した角位置情報	 */
};
/*	-----------------------------------------------------------------------	 */
/*				Copyright HAL College of Technology & Design				 */
/*	-----------------------------------------------------------------------	 */
#endif