/*	-----------------------------------------------------------------------	 */
/*	dgStatic_Color_Get.h												   	 */
/*	カラーセンサー情報取得												 */
/*	-----------------------------------------------------------------------	 */
/*	番号	更新履歴								日付		氏名		 */
/*	-----------------------------------------------------------------------	 */
/*	000000	新規作成								2018/05/15	髙岡 諒太	 */
/*	-----------------------------------------------------------------------	 */


/*	-----------------------------------------------------------------------	 */
/*	include	ファイル														 */
/*	-----------------------------------------------------------------------	 */
#include "ev3api.h"								/* ev3に用意されたapi		 */
#include "common.h"								/* typedef宣言等			 */
#include "app.h"								/*mainヘッダー				 */
#include <stdio.h>								/* 入出力ライブラリ			 */
#include <stdlib.h>								/* 標準ライブラリー			 */
#include <string.h>								/* 文字列操作系				 */

static class dgColor_Get{

public:
	/* publicメソッド */
	static dgColor_Get& GetInstance(void);	/* 実体作成メソッド		 */
	SINT ColorGet();							/* 色情報引き渡しメソッド	 */
private:
	/* privateメソッド------------------------------------------------------ */
	dgColor_Get();						/* コンストラクタ			 */
	~dgColor_Get();						/* デストラクタ				 */
	/* シングルトンに必要な奴 */
	dgColor_Get(const dgColor_Get &x) { };
	dgColor_Get&operator=(const dgColor_Get &) { return *this; };
	/* 色情報更新 */
	void ColorUpdate(void);


	/* private変数---------------------------------------------------------- */
	uint8_t i_color_info;							/* 取得した色情報			 */
};