/*	-----------------------------------------------------------------------	 */
/*	dcTail_Motor_Output.cpp													 */
/*	尻尾モーター制御														 */
/*	-----------------------------------------------------------------------	 */
/*	番号	更新履歴								日付		氏名		 */
/*	-----------------------------------------------------------------------	 */
/*	000000	新規作成								2018/07/13	廖  振勛	 */
/*	000001	関数名修正								2018/07/14	廖  振勛	 */
/*	000002	コード修正								2018/07/18	廖  振勛	 */
/*	000003	コード修正								2018/07/20	廖  振勛	 */
/*	-----------------------------------------------------------------------	 */

/*	-----------------------------------------------------------------------	 */
/*	include	ファイル														 */
/*	-----------------------------------------------------------------------	 */
#include "dcTail_Motor_Output.h"
#include "..\frLog\frLog.h"

/* ------------------------------------------------------------------------- */
/* ■■■ public ■■■													     */
/* ------------------------------------------------------------------------- */

/* ------------------------------------------------------------------------- */
/* 関数名	:dcTail_Motor_Output::dcTail_Motor_Output 						 */
/* 機能名	:コンストラクタ			 									     */
/* 機能概要	:尻尾モーターのポート設定   									 */
/* 引数		:なし							     						     */
/* 戻り値	:なし															 */
/* 作成日	:2018/07/13		廖  振勛			新規作成					 */
/*	-----------------------------------------------------------------------	 */
dcTail_Motor_Output::dcTail_Motor_Output(void){
	
	/* 尻尾モータセンサーポート設定 */
	ev3_motor_config( EV3_PORT_A,LARGE_MOTOR);
}

/* ------------------------------------------------------------------------- */
/* 関数名	:dcTail_Motor_Output::TailMotorOutput 							 */
/* 機能名	:尻尾モーターコントロール			 						     */
/* 機能概要	:尻尾モーター出力   											 */
/* 引数		:なし							     						     */
/* 戻り値	:なし															 */
/* 作成日	:2018/07/26		廖  振勛			新規作成					 */
/*	-----------------------------------------------------------------------	 */
void dcTail_Motor_Output::TailStart(SINT i_tail){

	if( i_tail == TAIL_DOWN){
		
		/*モーターのエンコーダー値のリセット*/
		ev3_motor_reset_counts	(EV3_PORT_A);
		
		/*	尻尾を下げる	*/
		ev3_motor_rotate(EV3_PORT_A,100,+50, true);
		
	}else if( i_tail == TAIL_UP ){
		/*	尻尾を上げる	*/
		ev3_motor_rotate(EV3_PORT_A,100,+50, false);
	}
}


/* ------------------------------------------------------------------------- */
/* 関数名	:dcTail_Motor_Output::dcTail_Motor_Output 						 */
/* 機能名	:尻尾モーターコントロール			 						     */
/* 機能概要	:尻尾モーター出力   											 */
/* 引数		:SINT degree 回転角度			     						     */
/* 戻り値	:なし															 */
/* 作成日	:2018/07/13	廖  振勛			新規作成						 */
/*	-----------------------------------------------------------------------	 */
void dcTail_Motor_Output::TailMotorOutput(SINT degree) {   //モーター出力
frLog &log = frLog::GetInstance();
	
	/* Tモーターを回す */
	ev3_motor_rotate(EV3_PORT_A,degree ,+50, true);
	/*	回転が完了したら出る	*/
	
	log.LOG(LOG_ID_MOTOR,"TailDegree:%d\r\n",degree);
	
}

/*	-----------------------------------------------------------------------	 */
/*				Copyright HAL College of Technology & Design				 */
/*	-----------------------------------------------------------------------	 */
