/*	------------------------------------------------------------------------ */
/*	raMotor_Setting_Value.cpp														   	 */
/*	ET-ロボコン																 */
/*	初期化時にジャイロセンサーの値のセットを指示するクラス					 */
/*	-----------------------------------------------------------------------	 */
/*	番号	更新履歴								日付		氏名		 */
/*	-----------------------------------------------------------------------	 */
/*	000000	新規作成								2018/06/26	宇都宮　正章 */
/*  000001  改訂履歴                                2018/07/20  有本 侑真    */
/*	-----------------------------------------------------------------------	 */

/*	-----------------------------------------------------------------------	 */
/*	include	ファイル														 */
/*	-----------------------------------------------------------------------	 */
#include"raMotor_Setting_Value.h"
#include "..\stMotor_Initialization\stMotor_Initialization.h"
#include "..\frLog\frLog.h"
//必要ヘッダは各自で入れること
/*	-----------------------------------------------------------------------	 */
/*	コンストラクタ															 */
/*	-----------------------------------------------------------------------	 */

raMotor_Setting_Value::raMotor_Setting_Value(){}

/*	-----------------------------------------------------------------------	 */
/*	デストラクタ															 */
/*	-----------------------------------------------------------------------	 */

raMotor_Setting_Value::~raMotor_Setting_Value(){}


/* ------------------------------------------------------------------------- */
/* ■■■ public ■■■														 */
/* ------------------------------------------------------------------------- */

/*	-----------------------------------------------------------------------	 */
/*	public関数名	:MotorValueSet											 */
/*	機能名			:モーター値設定											 */
/*	機能概要		:モーター値を設定する									 */
/*	引数			:SINT               : L									 */
/*	戻り値			:int				: FUNC_OK	:関数正常終了			 */
/*					:					: FUNC_ERR	:関数異常終了			 */
/*	作成日			:2018/06/26		 宇都宮　正章				 新規作成	 */
/*                  :2018/07/13      有本　侑真                  修正        */
/*  改訂履歴        :2018/07/20      有本  侑真                              */
/*	-----------------------------------------------------------------------	 */
SINT raMotor_Setting_Value::MotorValueSet(SINT*L, SINT*R, SINT*T){
	frLog &log = frLog::GetInstance();
	log.LOG(LOG_ID_MOTOR,"raMotor_Setting_Value::MotorValueSet\n");
	class stMotor_Initialization st;
	st.MotorMeasurement(L,R,T);
	return FUNC_OK;

}
/*	-----------------------------------------------------------------------	 */
/*				Copyright HAL College of Technology & Design				 */
/*	-----------------------------------------------------------------------	 */
