#ifndef __SONIC__
#define __SONIC__
/*	-----------------------------------------------------------------------	 */
/*	dgUltrasonic_Wave_Get.h												   	 */
/*	距離情報取得															 */
/*	-----------------------------------------------------------------------	 */
/*	番号	更新履歴								日付		氏名		 */
/*	-----------------------------------------------------------------------	 */
/*	000000	新規作成								2018/07/13	髙岡 諒太	 */
/*	-----------------------------------------------------------------------	 */
/*	-----------------------------------------------------------------------	 */
/*	include	ファイル														 */
/*	-----------------------------------------------------------------------	 */
#include "..\common\common.h"								/* typedef宣言等			 */
#include "ev3api.h"								/* ev3apiライブラリー		 */
/* クラス宣言--------------------------------------------------------------- */
class dgUltrasonic_Wave_Get{

public:
	/* publicメソッド */
	static dgUltrasonic_Wave_Get& GetInstance(void);	/* 実体作成メソッド	 */
	int16_t DistanceGet();							/* 距離情報引き渡しメソッド	 */
	void DistanceUpdate(void);					/* 距離情報更新メソッド		 */
private:
	/* privateメソッド------------------------------------------------------ */
	dgUltrasonic_Wave_Get();						/* コンストラクタ		 */
	~dgUltrasonic_Wave_Get();						/* デストラクタ			 */
	/* シングルトンに必要な奴 */
	dgUltrasonic_Wave_Get(const dgUltrasonic_Wave_Get &x) { };
	dgUltrasonic_Wave_Get&operator=(const dgUltrasonic_Wave_Get &) { return *this; };
	/* private変数---------------------------------------------------------- */
	int16_t i_distance_info;						/* 取得した距離情報		 */
};
#endif