/*	------------------------------------------------------------------------ */
/*	stMotor.cpp															   	 */
/*	ET-ロボコン																 */
/*	初期化時に値を渡すクラス												 */
/*	-----------------------------------------------------------------------	 */
/*	番号	更新履歴								日付		氏名		 */
/*	-----------------------------------------------------------------------	 */
/*	000000	新規作成								2018/07/09	有本　侑真　 */
/*	-----------------------------------------------------------------------	 */

/*	-----------------------------------------------------------------------	 */
/*	include	ファイル														 */
/*	-----------------------------------------------------------------------	 */
#include "common.h"
#include "stMotor_Set.h"
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
/*	-----------------------------------------------------------------------	 */
/*	コンストラクタ															 */
/*	-----------------------------------------------------------------------	 */
stMotor_Initialization::stMotor_Initialization()
{

}

/*	-----------------------------------------------------------------------	 */
/*	デストラクタ															 */
/*	-----------------------------------------------------------------------	 */
stMotor_Initialization::~stMotor_Initialization()
{
	
}

/* ------------------------------------------------------------------------- */
/* ■■■ public ■■■														 */
/* ------------------------------------------------------------------------- */

/*	-----------------------------------------------------------------------	 */
/*	public関数名	:MotorMeasurement										 */
/*	機能名			:モーター計測											 */
/*	機能概要		:各モーターの遊び範囲の値を渡す							 */
/*	引数			:SINT               : L									 */
/*                  :                   : R                                  */
/*                  :                   : T                                  */
/*	戻り値			:int				: FUNC_OK	:関数正常終了			 */
/*					:					: FUNC_ERR	:関数異常終了			 */
/*	作成日			:2018/07/09		 有本　侑真  	             新規作成	 */
/*	-----------------------------------------------------------------------	 */
SINT stMotor_Initialization::MotorMeasurement(I08T *Max,
	SINT *L,SINT *R,SINT *T)
{
	MaxMotorMeasurement(Max);
	LGearPlayRange(L);
	RGearPlayRange(R);
	TailGearPlayRange(T);
	return FUNC_OK;
}

/* ------------------------------------------------------------------------- */
/* ■■■ private ■■■													 */
/* ------------------------------------------------------------------------- */

/*	---------------------------------------------------------------------- - */
/*	public関数名	:MaxMotorMeasurement									 */
/*	機能名			:Maxモーター計測										 */
/*	機能概要		:モーターのMaxの値を渡す								 */
/*	引数			:SINT 				: L									 */
/*	戻り値			:int				: FUNC_OK	:関数正常終了			 */
/*					:					: FUNC_ERR	:関数異常終了			 */
/*	作成日			:2018/07/10		 有本　侑真 				 新規作成	 */
/*	-----------------------------------------------------------------------	 */
SINT stMotor_Initialization::MaxMotorMeasurement(I08T *Max)
{
	I08T MaxL = 100;                                      /* 左モーターMax値 */
	I08T MaxR = 100;                                      /* 右モーターMax値 */
	class dcMotor_Output dcM;                        /* dcMotor_Output実体化 */
	dcM.Motor_Output(MaxL,MaxR);
	/* MaxLがMaxRより値が低かった場合                                        */
	if (MaxL<MaxR)
	{
		*Max = MaxL;
	}
	/* MaxRがMaxLより値が低かった場合                                        */
	else if (MaxR<MaxL){
		*Max = MaxR;
	}
	return FUNC_OK;
}
/*	---------------------------------------------------------------------- - */
/*	public関数名	:LGearPlayRange											 */
/*	機能名			:左ギア遊び範囲計測										 */
/*	機能概要		:左ギアの遊び範囲値を渡す								 */
/*	引数			:SINT 				: LGearPlayRangevalue				 */
/*	戻り値			:int				: FUNC_OK	:関数正常終了			 */
/*					:					: FUNC_ERR	:関数異常終了			 */
/*	作成日			:2018/07/10		 有本　侑真 				 新規作成	 */
/*	-----------------------------------------------------------------------	 */
SINT stMotor_Initialization::LGearPlayRange(SINT *LGearPlayRangevalue)
{
	*LGearPlayRangevalue = 4;						   /* 左ギアの遊び範囲値 */
	return FUNC_OK;
}

/*	---------------------------------------------------------------------- - */
/*	public関数名	:RGearPlayRange											 */
/*	機能名			:右ギア遊び範囲計測										 */
/*	機能概要		:右ギアの遊び範囲値を渡す								 */
/*	引数			:SINT 				: RGearPlayRangevalue				 */
/*	戻り値			:int				: FUNC_OK	:関数正常終了			 */
/*					:					: FUNC_ERR	:関数異常終了			 */
/*	作成日			:2018/07/10		 有本　侑真 				 新規作成	 */
/*	-----------------------------------------------------------------------	 */
SINT stMotor_Initialization::RGearPlayRange(SINT *RGearPlayRangevalue)
{
	*RGearPlayRangevalue = 4;						   /* 右ギアの遊び範囲値 */
	return FUNC_OK;
}

/*	---------------------------------------------------------------------- - */
/*	public関数名	:TailGearPlayRange										 */
/*	機能名			:尻尾ギア遊び範囲計測									 */
/*	機能概要		:尻尾ギアの遊び範囲値を渡す								 */
/*	引数			:SINT 				: TailGearPlayRangevalue			 */
/*	戻り値			:int				: FUNC_OK	:関数正常終了			 */
/*					:					: FUNC_ERR	:関数異常終了			 */
/*	作成日			:2018/07/10		 有本　侑真 				 新規作成	 */
/*	-----------------------------------------------------------------------	 */
SINT stMotor_Initialization::TailGearPlayRange(SINT *TailGearPlayRangevalue)
{
	*TailGearPlayRangevalue = 4;					 /* 尻尾ギアの遊び範囲値 */
	return FUNC_OK;
}

/*	-----------------------------------------------------------------------	 */
/*				Copyright HAL College of Technology & Design				 */
/*	-----------------------------------------------------------------------	 */