/* ------------------------------------------------------------------------- */
/* rnLine_Trace.h                                                            */
/* ETロボコン開発                                                            */
/* rnLine_Trace.cppのヘッダーファイルです。                                  */
/*                                                                           */
/* ------------------------------------------------------------------------- */
/* 番号   更新履歴                             日付         氏名             */
/* ------------------------------------------------------------------------- */
/* 000000 新規作成                             2018/07/02   甲田　啓朗       */
/* 000001 コメント追加                         2018/07/12   甲田　啓朗       */
/* ------------------------------------------------------------------------- */


//#ifndef EV3_APP_LINETRACER_H_
//#define EV3_APP_LINETRACER_H_

/* ------------------------------------------------------------------------- */
/* include ファイル                                                          */
/* ------------------------------------------------------------------------- */
#include <stdio.h>

/* ------------------------------------------------------------------------- */
/* Class                                                                     */
/* ------------------------------------------------------------------------- */
class rnLine_Trace {
public:
	/* コンストラクタ処理の為の宣言 */
	rnLine_Trace(raLine_Threshold_Value& line_threshold_value);

	SINT LineTracing();                                    /* ライントレース */

private:
	/* ラインしきい値クラスの参照渡し用変数 */
	raLine_Threshold_Value& mraLine_Threshold_Value;

	/* バランス走行に必要なものをリセットするか決める変数 */
	BOLL b_IsInitialized;

	SINT ColorDirection(SINT i_color); /* ラインの色から走行体の向きを決める */
};

//#endif  // EV3_APP_LINETRACER_H_

/* ------------------------------------------------------------------------- */
/*              Copyright HAL College of Technology & Design                 */
/* ------------------------------------------------------------------------- */

